# **SQL Notes**

In [2]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## General 

### Order of Execution
SQL code is not processed in the order that it is written, the actual order of execution of the operations is:
<!-- |Operation |Description |
|--|--|
| `FROM` 		|first SQL will access the table from which data should be grabbed|
| `JOIN` 		|then SQL will access other tables that are joined with the initial table|
| `WHERE` 		|then SQL will apply a filter on the data in the (joined) table|
| `GROUP BY` 	|next SQL will group the data in the (joined) table if applicable|
| `HAVING` 	|then SQL will apply a filter on the grouped data in the (joined) table|
| [...]		|Window Functions|
| `SELECT` 	|then SQL will look at which columns from the table the user has requested|
| `DISTINCT`	 |the select operation will return a column, from which the unique values can be extracted|
| `UNION`		|then SQL can combine the resulting columns with other tables using set operations|
| `ORDER BY` 	|then SQL will sort the values in the resulting table|
| `OFFSET`		|then SQL will ignore a set of values in the resulting table|
| `LIMIT / TOP` 	|finally SQL will output part of the table| -->

- `FROM` 		first SQL will access the table from which data should be grabbed
- `JOIN` 		then SQL will access other tables that are joined with the initial table
- `WHERE` 		then SQL will apply a filter on the data in the (joined) table
- `GROUP BY` 	next SQL will group the data in the (joined) table if applicable
- `HAVING` 	then SQL will apply a filter on the grouped data in the (joined) table
- [...]		Window Functions
- `SELECT` 	then SQL will look at which columns from the table the user has requested
- `DISTINCT`	 the select operation will return a column, from which the unique values can be extracted
- `UNION`		then SQL can combine the resulting columns with other tables using set operations
- `ORDER BY` 	then SQL will sort the values in the resulting table
- `OFFSET`		then SQL will ignore a set of values in the resulting table
- `LIMIT / TOP` 	finally SQL will output part of the table


<!-- <table>
    <tr>
        <th>Operation</th>
        <th>Description</th>
    </tr>
    <tr>
        <td>`FROM`</td>
        <td>first SQL will access the table from which data should be grabbed</td>
    </tr>
    <tr>
        <td>row 2, cell 1</td>
        <td>row 2, cell 2</td>
    </tr>
</table> -->

## Filter Data

In [4]:
%sql sqlite:///cinema.db

### Where - Numeric

The `WHERE` statement can be used to filter numeric data through the following set of operators
- `=`	equals to
- `>`	greater than
- `<`	less than
- `>=`	greater than or equal to
- `<=`	less than or equal to
- `<>`	not equal to

In [5]:
%%sql
SELECT title 
FROM films
WHERE release_year = 1960

 * sqlite:///cinema.db
Done.

[('Elmer Gantry',), ('Psycho',), ('The Apartment',)]

The `BETWEEN` statement can be used to filter numeric data between two values (inclusive)

In [8]:
%%sql 
SELECT title
FROM films
WHERE release_year BETWEEN 1994 AND 2000
LIMIT 5

 * sqlite:///cinema.db
Done.

[('3 Ninjas Kick Back',),
 ('A Low Down Dirty Shame',),
 ('Ace Ventura: Pet Detective',),
 ("Baby's Day Out",),
 ('Beverly Hills Cop III',)]

When performing a `WHERE` filter for multiple entries, the IN operator may be used

In [9]:
%%sql
SELECT title 
FROM films
WHERE release_year IN (1920, 1930, 1940)
LIMIT 5

 * sqlite:///cinema.db
Done.

[('Over the Hill to the Poorhouse',),
 ("Hell's Angels",),
 ('Boom Town',),
 ('Fantasia',),
 ('Pinocchio',)]

### Where - Text

If one is interested in filtering the data based on the entire/exact string, then the same operations for filtering numeric data can be used. 

The `LIKE` operator can be used to look for a sub-string in the string records/rows of a field/column. Here the `%` symbol is used to determine where any number of non-matching characters are allowed to be located  
- `‘The%’`	String has to start with ‘The’  
- `‘%The’`	String has to end with ‘The’  
- `‘%The%’`	String must contain ‘The’

In [10]:
%%sql 
SELECT name
FROM people
WHERE name LIKE 'Ade%'

 * sqlite:///cinema.db
Done.

[('Adel Karam',), ('Adelaide Kane',), ('Aden Young',)]

Alternatively the `_` symbol is used to determine where a *single non-matching character* is allowed to be located

In [11]:
%%sql
SELECT name
FROM people
WHERE name LIKE 'Ev_'

 * sqlite:///cinema.db
Done.

[('Eve',)]

Similar to filtering numeric data the `IN` operator may be used to check if a string is in a list

In [14]:
%%sql
SELECT title 
FROM films 
WHERE country IN ('Germany', 'France')
LIMIT(5)

 * sqlite:///cinema.db
Done.

[('Metropolis',),
 ("Pandora's Box",),
 ('The Train',),
 ('Une Femme Mariée',),
 ('Pierrot le Fou',)]

### Having - Grouped

The `WHERE` operator will not work on grouped data as it is executed before the `GROUP BY` operation. Instead the `HAVING` operator can be used.

In [17]:
%%sql 
SELECT release_year, COUNT(title) AS title_count
FROM films
GROUP BY release_year
HAVING COUNT(title) > 10
LIMIT(5)

 * sqlite:///cinema.db
Done.

[('1968', 11), ('1970', 12), ('1971', 11), ('1977', 16), ('1978', 16)]